/*
 * @Author: 李星阳
 * @Date: 2020-04-30 12:51:51
 * @LastEditors: 李星阳
 * @LastEditTime: 2020-05-03 13:36:01
 * @Description: 
 */

package main
import(
	"fmt"
)
var pt = fmt.Println

func main() {
	// var s01 = "床头我明月光"
	// var s02 = "疑是这地上霜"
	// var s03 = s01 + s02 //连接字符串
	// var s04 = `
	// 	第一行
	// 	第二行
	// `
	pt("字【节】长度：",)
	pt("字【符】长度：",)
	pt("连接多个字符串：",)
	pt("多行文本修剪首尾空格：",)
	
	pt("按某字符分割成切片：",)
	pt("查看是否包含某字符：",)
	pt("查看是否某字开头/结尾：",)
	pt("查看某字索引正序/倒序：",)

	// 转换
	pt("将【数组成员】连接成字符串：",)
	pt("将【整型】转成文字：",)
	pt("将【数值型】转成数值字符：",)
	// 遍历字符串
	
}
